#+STARTUP: showall
#+STARTUP: lognotestate
#+TAGS:
#+SEQ_TODO: TODO STARTED DONE DEFERRED CANCELLED | WAITING DELEGATED APPT
#+DRAWERS: HIDDEN STATE
#+TITLE: Templates and generic programming
#+CATEGORY: 
#+PROPERTY: header-args:sql             :engine postgresql  :exports both :cmdline csc370
#+PROPERTY: header-args:sqlite          :db /path/to/db  :colnames yes
#+PROPERTY: header-args:C++             :results output :flags -std=c++17 -Wall --pedantic -Werror
#+PROPERTY: header-args:R               :results output  :colnames yes


* How to use

- Simply call the function with the corresponding parameters. 
- C++ will instantiate a corresponding function based on the available templates

#+BEGIN_SRC C++ :main no :flags -std=c++17 -Wall --pedantic -Werror :results output :exports both
#include <iostream>
#include <vector>

template <typename T>
int compare(const T &v1, const T &v2)
{
    if (v1 < v2) return -1;
    if (v2 < v1) return 1;
    return 0;
}

int main()
{
    std::cout << compare(2,1) << std::endl;
    std::cout << compare(std::string("abc"),std::string("def")) << std::endl;
    std::cout << compare(std::vector<int>{1,2,3},
                         std::vector<int>{1,2,3}) << std::endl;

    return 0;
}

#+END_SRC

#+RESULTS:
#+begin_example
1
1
0
#+end_example

* Another example

#+BEGIN_SRC C++ :main no :flags -std=c++17 -Wall --pedantic -Werror :results output :exports both
#include <iostream>
#include <complex>

template <typename T1, typename T2>
T1 divide(T1 v1, T2 v2)
{ 
    return v1 / v2;
}

int main()
{
   std::cout << divide(1,2) << std::endl;   // integers
   std::cout << divide(1,2.0) << std::endl; // integer and double
   std::cout << divide(1.0,2) << std::endl; // double and integer
   std::cout << divide(std::complex<int>(1,2), 2); // int complex and int
   return 0;
}

#+END_SRC  

#+RESULTS:
#+begin_example
0
0
0.5
(0,1)
#+end_example

* Another example

- We have used versions of this before
- Allows to print any collection 

#+BEGIN_SRC C++ :main no :flags -std=c++17 -Wall --pedantic -Werror :results output :exports both
#include <iostream>
#include <string>
#include <vector>
#include <list>

template <typename T>
void print_collection(std::string msg, T &col)
{
    std::cout << msg  << std::endl;
    int i {0};
    for(auto it: col) {
       std::cout << i++ << ": "<< it << std::endl;
    } 
}

int main()
{
   std::vector<int> v{1,2,3};
   std::string st {"abc"};
   std::list<double> l{1.2, 3.5};

   print_collection("Vector",v);
   print_collection("String",st);
   print_collection("List",l);

   return 0;
}

#+END_SRC

#+RESULTS:
#+begin_example
Vector
0: 1
1: 2
2: 3
String
0: a
1: b
2: c
List
0: 1.2
1: 3.5
#+end_example

* Class templates

We can also create classes templates:

#+BEGIN_SRC C++ :main no :flags -std=c++17 -Wall --pedantic -Werror :results output :exports both
#include <iostream>
#include <string>

template <typename T>
class A {
   T data;
public:
   T get() { return data; };
   void set(T _v) { data = _v;};
};

int main()
{
   A<int> var1;
   var1.set(5);
   A<std::string> var2;
   var2.set("abc");
   
   std::cout << "Value of var1: " << var1.get() << std::endl;
   std::cout << "Value of var2: " << var2.get() << std::endl;
   
   return 0;
}

#+END_SRC

#+RESULTS:
#+begin_example
Value of var1 5
Value of var2 abc
#+end_example

- Template classes are instantiated with the form:

#+BEGIN_SRC C++
templateName<instanceType> variable;
#+END_SRC

- This is similar to the way standard library data structures (such as std::vector, or std::list).

* Defining method outside the class declaration

- In that case, every method should be preceeded with *template <typename ...>*
- See below:

#+BEGIN_SRC C++ :main no :flags -std=c++17 -Wall --pedantic -Werror :results output :exports both
#include <iostream>
#include <string>

template <typename T>
class A {
   T data;
public:
   T get();
   void set(T _v);
};

template <typename T>
T A<T>::get() 
{ 
  return data; 
}

template <typename T>
void A<T>::set(T _v)
{ 
   data = _v;
}

int main()
{
   A<int> var1;
   var1.set(5);
   A<std::string> var2;
   var2.set("abc");
   
   std::cout << "Value of var1: " << var1.get() << std::endl;
   std::cout << "Value of var2: " << var2.get() << std::endl;
   
   return 0;
}

#+END_SRC

#+RESULTS:
#+begin_example
Value of var1: 5
Value of var2: abc
#+end_example

* Member templates

- Classes can have methods that are templates

#+BEGIN_SRC C++ :main no :flags -std=c++17 -Wall --pedantic -Werror :results output :exports both
#include <iostream>
class B
{  
    int v;
public:
    B(int _v): v(_v) {};
    
    template <typename T>
    void print(T first) {
       std::cout << first << ":" << v << std::endl;
    }
};

int main()
{
   B val1(5);
   
   val1.print("string");
   val1.print(int(5));
   val1.print(double(10));

   return 0;
}

#+END_SRC

#+RESULTS:
#+begin_example
string:5
5:5
10:5
#+end_example

* And we can make member templates inside class templates


#+BEGIN_SRC C++ :main no :flags -std=c++17 -Wall --pedantic -Werror :results output :exports both
#include <iostream>
#include <string>

template <typename T>
class A {
   T data;
public:
   T get() { return data; };
   void set(T _v) { data = _v;};

   template <typename T2>
    void print(T2 first) {
       std::cout << first << ":" << data << std::endl;
    }

/*
    void print(std::string first) {
       std::cout << first << ":" << data << std::endl;
    };
    void print(int first) {
       std::cout << first << ":" << data << std::endl;
    }
    void print(double first) {
       std::cout << first << ":" << data << std::endl;
    }
*/
};

int main()
{
   A<int,double> var1;
   var1.set(5);
   A<std::string> var2;
   var2.set("abc");
   
   var1.print("value of var1");
   var1.print(int(0));

   return 0;
}

#+END_SRC


#+BEGIN_SRC C++ :main no :flags -std=c++17 -Wall --pedantic -Werror :results output :exports both
#include <iostream>
#include <string>

template <typename T,typename T2>
class A {
   T data;
public:
   T get() { return data; };
   void set(T _v) { data = _v;};

    void print(T2 first) {
       std::cout << first << ":" << data << std::endl;
    }
   
/*
    void print(std::string first) {
       std::cout << first << ":" << data << std::endl;
    };
    void print(int first) {
       std::cout << first << ":" << data << std::endl;
    }
    void print(double first) {
       std::cout << first << ":" << data << std::endl;
    }
*/
};

int main()
{
   A<int,double> var1;
   var1.set(5);
   A<std::string> var2;
   var2.set("abc");
   
   var1.print("value of var1");
   var1.print(int(0));

   return 0;
}

#+END_SRC

#+RESULTS:
#+begin_example
value of var1:5
0:5
#+end_example

